* Contentsüîç
> 1. ÌåêÎã§Ïä§ ÏãúÎ¶¨Ï¶àÏóêÏÑú Í∞í ÏñªÍ∏∞
> 2. ÌåêÎã§Ïä§ ÏãúÎ¶¨Ï¶à ÏöîÏïΩÌÜµÍ≥Ñ
> 3. ÏãúÎ¶¨Ï¶à Í∞í Î≥ÄÍ≤Ω
> 4. (Ï°∞Í±¥Ïóê Îî∞Îùº) ÏãúÎ¶¨Ï¶à Í∞í Î≥ÄÍ≤Ω‚≠ê
> 5. Î¨∏ÏûêÏó¥ ÏãúÎ¶¨Ï¶à‚≠ê
> 6. ÎÇ†Ïßú Îã§Î£®Í∏∞‚≠ê
> 7. ÎàÑÎùΩ Îç∞Ïù¥ÌÑ∞ Îã§Î£®Í∏∞‚≠ê

#  ÌåêÎã§Ïä§ ÏãúÎ¶¨Ï¶àÏóêÏÑú Í∞í ÏñªÍ∏∞

In [44]:
import pandas as pd

pd.set_option('display.width', 200)
pd.set_option('display.max_columns', 35)
pd.set_option('display.max_rows', 200)
pd.options.display.float_format = '{:,.2f}'.format

nls97 = pd.read_csv("data/nls97b.csv")
nls97.set_index("personid", inplace=True)

In [60]:
# 1. create a series from the GPA column
gpaoverall = nls97.gpaoverall
type(gpaoverall), gpaoverall.index

(pandas.core.series.Series,
 Int64Index([100061, 100139, 100284, 100292, 100583, 100833, 100931, 101089,
             101122, 101132,
             ...
             998997, 999031, 999053, 999087, 999103, 999291, 999406, 999543,
             999698, 999963],
            dtype='int64', name='personid', length=8984))

In [61]:
gpaoverall.head(2)

personid
100061   3.06
100139    nan
Name: gpaoverall, dtype: float64

In [48]:
# 2. select gpa values using bracket notation
gpaoverall[:5]

personid
100061   3.06
100139    nan
100284    nan
100292   3.45
100583   2.91
Name: gpaoverall, dtype: float64

In [49]:
gpaoverall.tail()

personid
999291   3.11
999406   2.17
999543    nan
999698    nan
999963   3.78
Name: gpaoverall, dtype: float64

In [50]:
gpaoverall[-5:]

personid
999291   3.11
999406   2.17
999543    nan
999698    nan
999963   3.78
Name: gpaoverall, dtype: float64

In [51]:
# 3. select values using loc (Ïù¥Î¶Ñ)
gpaoverall.loc[100061]

3.06

In [53]:
gpaoverall.loc[[100061]]

personid
100061   3.06
Name: gpaoverall, dtype: float64

In [54]:
gpaoverall.loc[[100061,100139,100284]]

personid
100061   3.06
100139    nan
100284    nan
Name: gpaoverall, dtype: float64

In [55]:
gpaoverall.loc[100061:100833]

personid
100061   3.06
100139    nan
100284    nan
100292   3.45
100583   2.91
100833   2.46
Name: gpaoverall, dtype: float64

In [56]:
# 4. select values using iloc (ÏúÑÏπò)
gpaoverall.iloc[[0]]

personid
100061   3.06
Name: gpaoverall, dtype: float64

In [57]:
gpaoverall.iloc[[0,1,2,3,4]]

personid
100061   3.06
100139    nan
100284    nan
100292   3.45
100583   2.91
Name: gpaoverall, dtype: float64

In [58]:
gpaoverall.iloc[:5]

personid
100061   3.06
100139    nan
100284    nan
100292   3.45
100583   2.91
Name: gpaoverall, dtype: float64

In [59]:
gpaoverall.iloc[-5:]

personid
999291   3.11
999406   2.17
999543    nan
999698    nan
999963   3.78
Name: gpaoverall, dtype: float64

# ÌåêÎã§Ïä§ ÏãúÎ¶¨Ï¶à ÏöîÏïΩÌÜµÍ≥Ñ

In [62]:
import pandas as pd
import numpy as np
nls97 = pd.read_csv("data/nls97b.csv")
nls97.set_index("personid", inplace=True)

In [69]:
# 1. descriptive statistics
gpaoverall = nls97.gpaoverall
gpaoverall.mean()

2.8184077281812145

In [70]:
gpaoverall.describe()

count   6,004.00
mean        2.82
std         0.62
min         0.10
25%         2.43
50%         2.86
75%         3.26
max         4.17
Name: gpaoverall, dtype: float64

In [71]:
gpaoverall.quantile(np.arange(0.1,1.1,0.1))

0.10   2.02
0.20   2.31
0.30   2.52
0.40   2.70
0.50   2.86
0.60   3.01
0.70   3.17
0.80   3.36
0.90   3.60
1.00   4.17
Name: gpaoverall, dtype: float64

In [73]:
# 2. subset based on values
gpaoverall.loc[gpaoverall.between(3,3.5)].head(3)

personid
100061   3.06
100292   3.45
101526   3.37
Name: gpaoverall, dtype: float64

In [74]:
gpaoverall.loc[gpaoverall.between(3,3.5)].count()

1679

In [75]:
gpaoverall.loc[(gpaoverall<2) | (gpaoverall>4)].sample(5, random_state=2)

personid
932782   1.90
561335   1.82
850001   4.10
292455   1.97
644271   1.97
Name: gpaoverall, dtype: float64

In [76]:
gpaoverall.loc[gpaoverall>gpaoverall.quantile(0.99)].agg(['count','min','max']) # ÏÉÅÏúÑ 1%Ïùò ÎπàÎèÑ Î∞è ÏµúÏÜå/ÏµúÎåìÍ∞í

count   60.00
min      3.98
max      4.17
Name: gpaoverall, dtype: float64

In [77]:
# 3. run tests across all values
(gpaoverall>4).any() # any person has GPA greater than 4

True

In [78]:
(gpaoverall>=0).all() # all people have GPA greater than 0

False

In [79]:
(gpaoverall>=0).sum() # of people with GPA greater than 0

6004

In [82]:
(gpaoverall.isnull()==True).sum() # data length=8984

2980

In [80]:
(gpaoverall==0).sum() # of people with GPA equal to 0

0

In [65]:
gpaoverall.isnull().sum() # of people with missing value for GPA

2980

üìç True Ï°∞Í±¥ÏùÑ Í±∏ÏßÄ ÏïäÏïÑÎèÑ, TrueÏù∏ Í≤ÉÏóê ÎåÄÌï¥ÏÑúÎßå ÏöîÏïΩÌÜµÍ≥ÑÎ•º Î≥¥Ïó¨Ï§å  > e.g. (gpaoverall.isnull()==True).sum()

    Ï∞∏Í≥†Î°ú Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏùò length=8984

In [83]:
# 4. GPA for high/low wage income earners
nls97.loc[nls97.wageincome > nls97.wageincome.quantile(0.75),'gpaoverall'].mean()

3.0804171011470256

In [84]:
nls97.loc[nls97.wageincome < nls97.wageincome.quantile(0.25),'gpaoverall'].mean()

2.720143415906124

In [86]:
# 5. counts for series with categorical data
nls97.maritalstatus.describe()

count        6672
unique          5
top       Married
freq         3066
Name: maritalstatus, dtype: object

üìç topÏùÄ ÏµúÎπàÍ∞í

In [87]:
nls97.maritalstatus.value_counts()

Married          3066
Never-married    2766
Divorced          663
Separated         154
Widowed            23
Name: maritalstatus, dtype: int64

# ÏãúÎ¶¨Ï¶à Í∞í Î≥ÄÍ≤Ω

In [158]:
import pandas as pd
nls97 = pd.read_csv("data/nls97b.csv")
nls97.set_index("personid", inplace=True)

In [159]:
# 1. multiply all values of a series by scalar
nls97.gpaoverall.head()

personid
100061   3.06
100139    nan
100284    nan
100292   3.45
100583   2.91
Name: gpaoverall, dtype: float64

In [160]:
gpaoverall100 = nls97['gpaoverall'] * 100
gpaoverall100.head()

personid
100061   306.00
100139      nan
100284      nan
100292   345.00
100583   291.00
Name: gpaoverall, dtype: float64

In [161]:
# 2. use loc accessor to apply a scalar to selected rows
nls97.loc[[100061], 'gpaoverall'] = 3
nls97.loc[[100139,100284,100292],'gpaoverall'] = 0
nls97.gpaoverall.head()

personid
100061   3.00
100139   0.00
100284   0.00
100292   0.00
100583   2.91
Name: gpaoverall, dtype: float64

In [164]:
# 3. set values using more than one series
nls97[['childathome', 'childnotathome']].head(3)

          childathome  childnotathome
personid
100061           4.00            0.00
100139           2.00            0.00
100284           1.00            0.00

In [165]:
nls97['childnum'] = nls97.childathome + nls97.childnotathome
nls97.childnum.value_counts().sort_index()

0.00       23
1.00     1364
2.00     1729
3.00     1020
4.00      420
5.00      149
6.00       55
7.00       21
8.00        7
9.00        1
12.00       2
Name: childnum, dtype: int64

In [166]:
# 4. apply a summary value to selected rows
nls97.loc[100061:100292,'gpaoverall'] = nls97.gpaoverall.mean()
nls97.gpaoverall.head()

personid
100061   2.82
100139   2.82
100284   2.82
100292   2.82
100583   2.91
Name: gpaoverall, dtype: float64

In [167]:
# 5. use iloc accessor to apply a scalar to selected rows
nls97.iloc[0, 13] = 2
nls97.iloc[1:4, 13] = 1
nls97.gpaoverall.head()

personid
100061   2.00
100139   1.00
100284   1.00
100292   1.00
100583   2.91
Name: gpaoverall, dtype: float64

In [169]:
nls97.gpaoverall

personid
100061   2.00
100139   1.00
100284   1.00
100292   1.00
100583   2.91
         ...
999291   3.11
999406   2.17
999543    nan
999698    nan
999963   3.78
Name: gpaoverall, Length: 8984, dtype: float64

In [168]:
# 6. set values after filtering
nls97.gpaoverall.nlargest()

personid
312410   4.17
639701   4.11
850001   4.10
279096   4.08
620216   4.07
Name: gpaoverall, dtype: float64

üìç `.nlargest()`Îäî Í∞íÏù¥ ÎÜíÏùÄ nÎ≤àÏß∏ÍπåÏßÄ Ï∂úÎ†•

In [170]:
nls97.loc[nls97.gpaoverall>4, 'gpaoverall'] = 4
nls97.gpaoverall.nlargest()

personid
112756   4.00
119784   4.00
160193   4.00
250666   4.00
271961   4.00
Name: gpaoverall, dtype: float64

# (Ï°∞Í±¥Ïóê Îî∞Îùº) ÏãúÎ¶¨Ï¶à Í∞í Î≥ÄÍ≤Ω

In [174]:
import pandas as pd
import numpy as np

nls97 = pd.read_csv("data/nls97b.csv")
nls97.set_index("personid", inplace=True)
landtemps = pd.read_csv("data/landtemps2019avgs.csv")

In [175]:
# 1. use the numpy where function to create a categorical series with 2 values
landtemps.elevation.quantile(np.arange(0.2,1.1,0.2))

0.20      48.00
0.40     190.50
0.60     393.20
0.80   1,066.80
1.00   9,999.00
Name: elevation, dtype: float64

In [176]:
landtemps['elevation_group'] = np.where(landtemps.elevation>landtemps.elevation.quantile(0.8),'High','Low')
landtemps.elevation_group = landtemps.elevation_group.astype('category')
landtemps.groupby(['elevation_group'])['elevation'].agg(['count','min','max'])

                 count      min      max
elevation_group
High              2409 1,067.00 9,999.00
Low               9686  -350.00 1,066.80

In [177]:
# 2. use the numpy where function to create a categorical series with 3 values
landtemps.elevation.median()

271.3

In [178]:
landtemps['elevation_group'] = np.where(landtemps.elevation>landtemps.elevation.quantile(0.8),'High',\
                                        np.where(landtemps.elevation>landtemps.elevation.median(),'Medium','Low'))
landtemps.elevation_group = landtemps.elevation_group.astype('category')
landtemps.groupby(['elevation_group'])['elevation'].agg(['count','min','max'])

                 count      min      max
elevation_group
High              2409 1,067.00 9,999.00
Low               6056  -350.00   271.30
Medium            3630   271.40 1,066.80

In [ ]:
# 3. use numpy select to evaluate a list of conditions
test = [(nls97.gpaoverall<2) & (nls97.highestdegree=='0. None'), nls97.highestdegree=='0. None', nls97.gpaoverall<2]
result = ['1. Low GPA and No Diploma','2. No Diploma','3. Low GPA']
nls97['hsachieve'] = np.select(test, result, '4. Did Okay')
nls97[['hsachieve','gpaoverall','highestdegree']].head()
nls97.hsachieve.value_counts().sort_index()

In [ ]:
# 4. create a flag if individual ever had bachelor degree enrollment
nls97.loc[[100292,100583,100139], 'colenrfeb00':'colenroct04'].T
nls97['baenrollment'] = nls97.filter(like="colenr").\
  apply(lambda x: x.str[0:1]=='3').\
  any(axis=1)

In [179]:
# 5. create a flag if individual ever had bachelor degree enrollment
nls97.loc[[100292,100583,100139], 'colenrfeb00':'colenroct04'].T

personid                100292             100583           100139
colenrfeb00    1. Not enrolled    1. Not enrolled  1. Not enrolled
colenroct00  3. 4-year college    1. Not enrolled  1. Not enrolled
colenrfeb01  3. 4-year college    1. Not enrolled  1. Not enrolled
colenroct01  3. 4-year college  3. 4-year college  1. Not enrolled
colenrfeb02  3. 4-year college  3. 4-year college  1. Not enrolled
colenroct02  3. 4-year college    1. Not enrolled  1. Not enrolled
colenrfeb03  3. 4-year college    1. Not enrolled  1. Not enrolled
colenroct03  3. 4-year college    1. Not enrolled  1. Not enrolled
colenrfeb04  3. 4-year college    1. Not enrolled  1. Not enrolled
colenroct04    1. Not enrolled    1. Not enrolled  1. Not enrolled

In [180]:
nls97['baenrollment'] = nls97.filter(like="colenr").apply(lambda x: x.str[0:1]=='3').any(axis=1)

In [181]:
nls97.loc[[100292,100583,100139], ['baenrollment']].T

personid      100292  100583  100139
baenrollment    True    True   False

In [182]:
nls97.baenrollment.value_counts()

False    5085
True     3899
Name: baenrollment, dtype: int64

In [173]:
# 6. use apply and lambda to create a more complicated categorical series
def getsleepdeprivedreason(row):
  sleepdeprivedreason = "Unknown"
  if (row.nightlyhrssleep>=6):
    sleepdeprivedreason = "Not Sleep Deprived"
  elif (row.nightlyhrssleep>0):
    if (row.weeksworked16+row.weeksworked17 < 80):
      if (row.childathome>2):
        sleepdeprivedreason = "Child Rearing"
      else:
        sleepdeprivedreason = "Other Reasons"
    else:
      if (row.wageincome>=62000 or row.highestgradecompleted>=16):
        sleepdeprivedreason = "Work Pressure"
      else:
        sleepdeprivedreason = "Income Pressure"
  else:
    sleepdeprivedreason = "Unknown"
  return sleepdeprivedreason

nls97['sleepdeprivedreason'] = nls97.apply(getsleepdeprivedreason, axis=1)
nls97.sleepdeprivedreason = nls97.sleepdeprivedreason.astype('category')
nls97.sleepdeprivedreason.value_counts()

Not Sleep Deprived    5595
Unknown               2286
Income Pressure        462
Work Pressure          281
Other Reasons          272
Child Rearing           88
Name: sleepdeprivedreason, dtype: int64

# Î¨∏ÏûêÏó¥ ÏãúÎ¶¨Ï¶à
* **Î¨∏ÏûêÏó¥ ÏãúÎ¶¨Ï¶à Îç∞Ïù¥ÌÑ∞**Î•º ÌèâÍ∞ÄÌïòÍ≥† ÎåÄÏπòÌïòÎäî ÏûëÏóÖÏóê ÎπàÎ≤àÌûà ÏÇ¨Ïö©ÌïòÎäî Îã§ÏñëÌïú Î©îÏÑúÎìú ÏùµÌûàÍ∏∞

In [43]:
import pandas as pd
import numpy as np
nls97 = pd.read_csv('data/nls97c.csv') # ÎØ∏Íµ≠ Ï¢ÖÎã® Ï°∞ÏÇ¨(NLS) Îç∞Ïù¥ÌÑ∞
nls97.set_index('personid', inplace=True)

pd.set_option('display.width', 200)
pd.set_option('display.max_columns', 35)
pd.set_option('display.max_rows', 200)
pd.options.display.float_format = '{:,.2f}'.format

* **summaryüìå**
        - Î¨∏ÏûêÏó¥Ïùò ÏùºÎ∂ÄÎ•º ÏúÑÏπòÏóê Îî∞Îùº Ï∑®ÌïòÍ∏∞
          ‚≠êdf.{column name}.str.findall('\d+') - Î¨∏ÏûêÏó¥ÏóêÏÑú Ïà´ÏûêÎßå Ï∂îÏ∂ú > listÎ°ú Ï†ÄÏû•
          ‚≠êdf['new column name'] = np.where(df.{column name}.isnull(), np.nan, np.where(df.{column name}.Ï°∞Í±¥Î©îÏÑúÎìú, 'True Ï∂úÎ†•Í∞í', 'False Ï∂úÎ†•Í∞í'))
        - Î¨∏ÏûêÏó¥Ïóê ÌäπÏ†ï Ìå®ÌÑ¥Ïù¥ ÏûàÎäîÏßÄ ÌôïÏù∏ÌïòÍ∏∞  
          ‚≠êdf.{column name}.str.contains('a string') - ÌäπÏ†ï Î¨∏ÏûêÎ•º Ìè¨Ìï®ÌïòÎäîÏßÄ?
          ‚≠êdf.{column name}.str[i:i+j].isin(list) - Î¶¨Ïä§Ìä∏Ïóê ÏûàÎäîÏßÄ?
        - Î¨∏ÏûêÏó¥Ïóê ÏûàÎäî Í≥µÎ∞± Ï∞æÍ∏∞
          ‚≠êdf.{column name}.str.startswith(' ') - Í≥µÎ∞±ÏúºÎ°ú ÏãúÏûë
          ‚≠êdf.{column name}.str.endswith(' ') - Í≥µÎ∞±ÏúºÎ°ú ÎÅù
        - Î¨∏ÏûêÏó¥Ïóê ÏûàÎäî Í≥µÎ∞± Ï†úÍ±∞ÌïòÍ∏∞
          ‚≠êdf.{column name}.str.strip() - Îëò Îã§ Ï†úÍ±∞
          ‚≠êdf.{column name}.str.lstrip() - ÏãúÏûë Í≥µÎ∞± Ï†úÍ±∞
          ‚≠êdf.{column name}.str.rstrip() - ÎÅù Í≥µÎ∞± Ï†úÍ±∞
        - Î¨∏ÏûêÏó¥ÏùÑ Î∂ÑÌï†ÌïòÍ∏∞
        - Î¨∏ÏûêÏó¥ Í∏∏Ïù¥Î•º Íµ¨ÌïòÍ∏∞  
        - Îëò Ïù¥ÏÉÅÏùò Î¨∏ÏûêÏó¥ÏùÑ Ïó∞Í≤∞ÌïòÍ∏∞  
        - ÎåÄÏÜåÎ¨∏ÏûêÎ•º Î≥ÄÍ≤ΩÌïòÍ∏∞

In [6]:
# 1. test whether a str pattern exists 
nls97.govprovidejobs.value_counts()

2. Probably          617
3. Probably not      462
1. Definitely        454
4. Definitely not    300
Name: govprovidejobs, dtype: int64

In [19]:
nls97['govprovidejobsdefprob'] = np.where(nls97.govprovidejobs.isnull(), np.nan, np.where(nls97.govprovidejobs.str.contains('not'), 'No', 'Yes'))
nls97[['govprovidejobsdefprob']].sample(3)

         govprovidejobsdefprob
personid
570949                     Yes
205723                     nan
151540                      No

üìç govprovidejob(Ï†ïÎ∂ÄÏóêÏÑú ÏùºÏûêÎ¶¨Î•º Ï†úÍ≥µÌï¥Ïïº ÌïòÎäîÏßÄ)Ïóê ÎåÄÌïú ÏùëÎãµÏóê 'not'Ïù¥ Ìè¨Ìï®ÎêòÎäîÏßÄÎ•º **contain**ÏúºÎ°ú Ï°∞ÏÇ¨Ìïú Í≤∞Í≥º(Yes or No)Î•º ÏÉàÎ°úÏö¥ Ïó¥Î°ú ÏÉùÏÑ±Ìï®

In [7]:
pd.crosstab(nls97.govprovidejobs, nls97.govprovidejobsdefprob)

govprovidejobsdefprob   No  Yes
govprovidejobs
1. Definitely            0  454
2. Probably              0  617
3. Probably not        462    0
4. Definitely not      300    0

In [20]:
# 2. handle spaces in a string
nls97.maritalstatus.value_counts()

Married          3064
Never-married    2766
Divorced          663
Separated         154
Widowed            23
Married             2
Name: maritalstatus, dtype: int64

In [26]:
nls97.maritalstatus.str.endswith(' ').any() # ' 'ÏúºÎ°ú ÎÅùÎÇòÎäî Í∞íÏù¥ Ìïú Í∞úÎùºÎèÑ ÏûàÎäîÍ∞Ä

True

In [27]:
nls97.maritalstatus.str.startswith(' ').any() # ' 'ÏúºÎ°ú ÏãúÏûëÌïòÎäî Í∞íÏù¥ Ìïú Í∞úÎùºÎèÑ ÏûàÎäîÍ∞Ä

False

In [30]:
nls97['maritalstatus'] = nls97.copy().maritalstatus.str.strip() # ÏãúÏûëÍ≥º ÎÅùÏùò Í≥µÎ∞±ÏùÑ Ï†úÍ±∞ 
nls97.maritalstatus.value_counts()

Married          3066
Never-married    2766
Divorced          663
Separated         154
Widowed            23
Name: maritalstatus, dtype: int64

In [28]:
nls97['evermarried'] = np.where(nls97.maritalstatus.isnull(), np.nan, np.where(nls97.maritalstatus.str.strip()=='Never-married', 'No', 'Yes'))
pd.crosstab(nls97.maritalstatus, nls97.evermarried)

evermarried      No   Yes
maritalstatus
Divorced          0   663
Married           0  3064
Married           0     2
Never-married  2766     0
Separated         0   154
Widowed           0    23

In [31]:
# 3. compare a string value to a list
nls97['receivedba'] = np.where(nls97.highestdegree.isnull(), np.nan, np.where(nls97.highestdegree.str[0:1].isin(['4','5','6','7']),'Yse','No'))
pd.crosstab(nls97.highestdegree, nls97.receivedba)

receivedba         No   Yse
highestdegree
0. None           953     0
1. GED           1146     0
2. High School   3667     0
3. Associates     737     0
4. Bachelors        0  1673
5. Masters          0   603
6. PhD              0    54
7. Professional     0   120

In [42]:
# 4. convert a text response to numeric using numbers in the text
pd.concat([nls97.weeklyhrstv, nls97.weeklyhrstv.str.findall('\d+')], axis=1).sample(5)

                         weeklyhrstv weeklyhrstv
personid
747456          3 to 10 hours a week     [3, 10]
675082                           NaN         NaN
545053    Less than 2 hours per week         [2]
300981          3 to 10 hours a week     [3, 10]
452151    Less than 2 hours per week         [2]

üìç weeklyhrstv(ÏùºÏ£ºÏùºÎèôÏïà TVÏãúÍ∞ÑÏóê Î≥¥ÎÇ∏ ÏãúÍ∞Ñ) Î¨∏ÏûêÏó¥Ïóê Ìè¨Ìï®Îêú Ïà´ÏûêÎßå ÏñªÏñ¥ÎÇ¥Í∏∞ ÏúÑÌï¥ÏÑú findallÏóê Ï†ïÍ∑úÌëúÌòÑÏãù `'\d+'`Î•º Ï†ÑÎã¨Ìï®

In [38]:
def getnum(numlist):
    highval = 0
    if (type(numlist) is list):
        lastval = int(numlist[-1]) # listÏùò ÎßàÏßÄÎßâ ÏõêÏÜåÎ•º intÎ°ú Î≥ÄÌôòÌïòÏó¨ Í∞ùÏ≤¥Ïóê Ï†ÄÏû•
        if (numlist[0]=='40'): # listÏùò Ï≤´Î≤àÏß∏ Í∞íÏù¥ '40'Ïù¥Î©¥ (='More than 40 hours a week')
            highval = 45
        elif (lastval==2): # listÏùò ÎßàÏßÄÎßâ ÏõêÏÜåÎ•º intÎ°ú Î∞îÍæº Í∞íÏù¥ 2Ïù¥Î©¥ (='Less than 2 hours per week')
            highval = 1
        else:
            highval = lastval - 5
    else:
        highval = np.nan
    return highval

üìç **getnum Ìï®Ïàò**Îäî Îëò Ïù¥ÏÉÅÏùò ÏàòÍ∞Ä ÏûàÎäî Í≤ΩÏö∞, Îëê ÏàòÏùò Ï§ëÍ∞ÑÏóê Í∞ÄÍπùÎèÑÎ°ù Ïà´ÏûêÎ•º Ï°∞Ï†ïÌï¥Ï§ÄÎã§

In [89]:
nls97['weeklyhrstvnum'] = nls97.weeklyhrstv.str.findall('\d+').apply(getnum)
pd.crosstab(nls97.weeklyhrstv, nls97.weeklyhrstvnum)

weeklyhrstvnum                1     5     15   25   35   45
weeklyhrstv
11 to 20 hours a week          0     0  1145    0    0    0
21 to 30 hours a week          0     0     0  299    0    0
3 to 10 hours a week           0  3625     0    0    0    0
31 to 40 hours a week          0     0     0    0  116    0
Less than 2 hours per week  1350     0     0    0    0    0
More than 40 hours a week      0     0     0    0    0  176

# ÎÇ†Ïßú

In [88]:
import pandas as pd
import numpy as np
from datetime import datetime

covidcases = pd.read_csv("data/covidcases720.csv")
nls97 = pd.read_csv("data/nls97c.csv")
nls97.set_index("personid", inplace=True)

pd.set_option('display.width', 200)
pd.set_option('display.max_columns', 35)
pd.set_option('display.max_rows', 220)
pd.options.display.float_format = '{:,.0f}'.format

In [ ]:
# 1. show the birth month and year values
nls97[['birthmonth','birthyear']].head()
nls97[['birthmonth','birthyear']].isnull().sum()
nls97.birthmonth.value_counts().sort_index()
nls97.birthyear.value_counts().sort_index()

# 2. use fillna to fix missing value
nls97.birthmonth.fillna(int(nls97.birthmonth.mean()), inplace=True)
nls97.birthmonth.value_counts().sort_index()

# 3. use month and date integers to create a datetime column
nls97['birthdate'] = pd.to_datetime(dict(year=nls97.birthyear, month=nls97.birthmonth, day=15))
nls97.birthdate.describe()
nls97[['birthmonth','birthyear','birthdate']].head()
nls97[['birthmonth','birthyear','birthdate']].isnull().sum()

# 4. define a function for calculating given start and end date
def calcage(startdate, enddate):
    age = enddate.year - startdate.year
    if (enddate.month<startdate.month or (enddate.month==startdate.month and enddate.day<startdate.day)):
    age = age -1
    return age

# 5. calculate age
rundate = pd.to_datetime('2020-07-20')
nls97["age"] = nls97.apply(lambda x: calcage(x.birthdate, rundate), axis=1)
nls97.loc[100061:100583, ['age','birthdate']]

# 6. convert a string column to a datetime column
covidcases.iloc[:, 0:6].dtypes
covidcases.iloc[:, 0:6].sample(2, random_state=1).T
covidcases['casedate'] = pd.to_datetime(covidcases.casedate, format='%Y-%m-%d')
covidcases.iloc[:, 0:6].dtypes

# 7. get descriptive statistics on datetime column
covidcases.casedate.describe()

# 8. calculate days since first case by country
firstcase = covidcases.loc[covidcases.new_cases>0,['location','casedate']].\
  sort_values(['location','casedate']).\
  drop_duplicates(['location'], keep='first').\
  rename(columns={'casedate':'firstcasedate'})
covidcases = pd.merge(covidcases, firstcase, left_on=['location'], right_on=['location'], how="left")
covidcases['dayssincefirstcase'] = covidcases.casedate - covidcases.firstcasedate
covidcases.dayssincefirstcase.describe()

# ÎàÑÎùΩ Îç∞Ïù¥ÌÑ∞

In [117]:
import pandas as pd

pd.set_option('display.width', 200)
pd.set_option('display.max_columns', 12)
pd.set_option('display.max_rows', 100)
pd.options.display.float_format = '{:,.0f}'.format

nls97 = pd.read_csv("data/nls97c.csv")
nls97.set_index("personid", inplace=True)

In [118]:
# 1. set up school record and demographic data frames from the NLS data
schoolrecordlist = ['satverbal','satmath','gpaoverall','gpaenglish','gpamath','gpascience','highestdegree','highestgradecompleted']
demolist = ['maritalstatus','childathome','childnotathome', 'wageincome','weeklyhrscomputer','weeklyhrstv','nightlyhrssleep']
schoolrecord = nls97[schoolrecordlist]
demo = nls97[demolist]
schoolrecord.shape, demo.shape

((8984, 8), (8984, 7))

In [119]:
# 2. check the school record data for missings
schoolrecord.isnull().sum(axis=0) # Ïª¨ÎüºÎ≥Ñ

satverbal                7578
satmath                  7577
gpaoverall               2980
gpaenglish               3186
gpamath                  3218
gpascience               3300
highestdegree              31
highestgradecompleted    2321
dtype: int64

In [120]:
misscnt = schoolrecord.isnull().sum(axis=1) # Î°úÏö∞Î≥Ñ
misscnt.value_counts().sort_index()

0    1087
1     312
2    3210
3    1102
4     176
5     101
6    2039
7     946
8      11
dtype: int64

In [121]:
schoolrecord.loc[misscnt>=7].head(4).T # Î°úÏö∞(row)Í∏∞Ï§Ä Í≤∞Ï∏°Í∞íÏù¥ 6Í∞úÍ∞Ä ÎÑòÎäî Îç∞Ïù¥ÌÑ∞

personid               101705   102061  102648   104627
satverbal                 NaN      NaN     NaN      NaN
satmath                   NaN      NaN     NaN      NaN
gpaoverall                NaN      NaN     NaN      NaN
gpaenglish                NaN      NaN     NaN      NaN
gpamath                   NaN      NaN     NaN      NaN
gpascience                NaN      NaN     NaN      NaN
highestdegree          1. GED  0. None  1. GED  0. None
highestgradecompleted     NaN      NaN     NaN      NaN

üìç `Î°úÏö∞(row)Î≥Ñ ÎàÑÎùΩ Îç∞Ïù¥ÌÑ∞Ïùò Í∞úÏàòÎ•º ÌèâÍ∞ÄÌïòÎäî misscnt Í∞ùÏ≤¥`Î•º **loc**Ïóê ÌôúÏö©Ìï¥ÏÑú Ïì∏ Ïàò ÏûàÎã§.

In [122]:
# 3. remove rows with almost all missing data
schoolrecord = schoolrecord.dropna(thresh=2)
schoolrecord.shape

(8027, 8)

üìç dropna Î©îÏÑúÎìúÏùò **thresh** ÏòµÏÖòÏùÑ 2Î°ú ÏÑ§Ï†ïÌïòÎ©¥ > ÎπÑÎàÑÎùΩÍ∞íÏù¥ 2Í∞ú ÎØ∏ÎßåÏù∏ Ìñâ(=ÎàÑÎùΩÍ∞íÏù¥ 7~8Í∞úÏù∏ Ìñâ) ÏÇ≠Ï†úÎê®

In [123]:
schoolrecord.isnull().sum(axis=1).value_counts().sort_index()

0    1087
1     312
2    3210
3    1102
4     176
5     101
6    2039
dtype: int64

In [124]:
# 4. assign mean values to missings
int(schoolrecord.gpaoverall.mean())

2

In [125]:
schoolrecord.gpaoverall.isnull().sum()

2023

In [126]:
schoolrecord.gpaoverall.fillna(int(schoolrecord.gpaoverall.mean()), inplace=True)
schoolrecord.gpaoverall.isnull().sum()

0

In [127]:
# 5. use forward fill
demo.wageincome.head().T

personid
100061    12,500
100139   120,000
100284    58,000
100292       nan
100583    30,000
Name: wageincome, dtype: float64

In [128]:
demo.wageincome.isnull().sum()

3893

In [129]:
nls97.wageincome.fillna(method='ffill', inplace=True)

üìç fillnaÏùò `ffill` ÏòµÏÖòÏùÄ ÎàÑÎùΩÍ∞íÏùÑ Ïù¥Ï†ÑÏóê ÎÇòÏò® Í∞ÄÍπåÏö¥ ÎπÑÎàÑÎùΩÍ∞íÏúºÎ°ú ÎåÄÏ≤¥Ìï¥Ï§ÄÎã§

In [131]:
demo = nls97[demolist]
demo.wageincome.head().T

personid
100061    12,500
100139   120,000
100284    58,000
100292    58,000
100583    30,000
Name: wageincome, dtype: float64

In [132]:
demo.wageincome.isnull().sum()

0

In [133]:
# 6. fill missings with the average by group
nls97[['highestdegree','weeksworked17']].head()

           highestdegree  weeksworked17
personid
100061    2. High School             48
100139    2. High School             52
100284           0. None              0
100292      4. Bachelors            nan
100583    2. High School             52

In [140]:
workbydegree = nls97.groupby(['highestdegree'])['weeksworked17'].mean().reset_index().rename(columns={'weeksworked17':'meanweeksworked17'})
# Ï¶â, 'ÏµúÏ¢ÖÌïôÎ†•' Í∏∞Ï§ÄÏúºÎ°ú 17ÎÖÑÎèÑ Ï£ºÎãπ Í∑ºÎ°úÏãúÍ∞ÑÏùÑ Î¨∂ÏùÄ Îí§, Í∑∏Î£πÌôîÌïú Î≤îÏúÑ Î≥ÑÎ°ú ÌèâÍ∑†ÏùÑ Í≥ÑÏÇ∞Ìï®

* Ï§ëÍ∞ÑÍ≥ºÏ†ï

In [141]:
nls97.groupby(['highestdegree'])['weeksworked17'].mean()

highestdegree
0. None           29
1. GED            35
2. High School    38
3. Associates     40
4. Bachelors      44
5. Masters        45
6. PhD            44
7. Professional   47
Name: weeksworked17, dtype: float64

In [142]:
nls97.groupby(['highestdegree'])['weeksworked17'].mean().reset_index().rename(columns={'weeksworked17':'meanweeksworked17'})

     highestdegree  meanweeksworked17
0          0. None                 29
1           1. GED                 35
2   2. High School                 38
3    3. Associates                 40
4     4. Bachelors                 44
5       5. Masters                 45
6           6. PhD                 44
7  7. Professional                 47

In [143]:
workbydegree

     highestdegree  meanweeksworked17
0          0. None                 29
1           1. GED                 35
2   2. High School                 38
3    3. Associates                 40
4     4. Bachelors                 44
5       5. Masters                 45
6           6. PhD                 44
7  7. Professional                 47

In [153]:
nls97 = nls97.reset_index().merge(workbydegree, left_on=['highestdegree'], right_on=['highestdegree'], how='left').set_index('personid')
# Ï¶â, nls97 Îç∞Ïù¥ÌÑ∞ÏôÄ workbydegree Îç∞Ïù¥ÌÑ∞Î•º 'highestdegree'Í∏∞Ï§ÄÏúºÎ°ú left join 
# => Í∑∏ Í≤∞Í≥ºÎ°ú nls97 Îç∞Ïù¥ÌÑ∞Ïóê ÏµúÏ¢ÖÌïôÎ†•Î≥Ñ ÌèâÍ∑† Ï£ºÎãπÍ∑ºÎ°úÏãúÍ∞Ñ ÏπºÎüºÏù¥ Ï∂îÍ∞ÄÎê®

In [154]:
nls97.weeksworked17.fillna(nls97.meanweeksworked17, inplace=True) # ÏÜçÌïú ÏµúÏ¢ÖÌïôÎ†• ÏßëÎã®Ïùò ÌèâÍ∑† Ï£ºÎãπÍ∑ºÎ°úÏãúÍ∞ÑÏúºÎ°ú Í≤∞Ï∏°Í∞íÏù¥ ÎåÄÏ≤¥Îê®
nls97[['highestdegree','weeksworked17','meanweeksworked17']].head()

           highestdegree  weeksworked17  meanweeksworked17
personid
100061    2. High School             48                 38
100139    2. High School             52                 38
100284           0. None              0                 29
100292      4. Bachelors             44                 44
100583    2. High School             52                 38